_org/_posts/2019-01-13-adhock-computer-lab.org
#+TITLE:     Ad-Hock Computer Lab
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+DATE:      2019-01-13
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
# #+INFOJS_OPT: view:overview toc:t ltoc:t mouse:#aadddd buttons:0 path:js/org-info.js
#+STYLE: <link rel="stylesheet" type="text/css" href="css/org-info.css" />
#+begin_comment yaml-front-matter
---
layout:     post
title:      Ad-Hock Computer Lab
date:       2019-01-13

summary: A computer lab is usually a classroom of 20-30 computers, connected
  to a switch that makes a LAN. These computers are usually managed with LTSP,
  which reduces the hardware costs and the time and efforts needed for
  installing and maintaining all of them. What if there is no computer lab
  but all the students have laptops? Can we build a similar infrastructure,
  based on WiFi? Yes we can, and in this article we will see how. What if
  the students are not located on the same classroom but are distributed
  all over the world? Can we offer them some centralized services and build
  a virtual classroom? There may be many ways of doing it but we will
  see just one.

tags:       LTSP VirtualBox vagrantup Guacamole docker
---
#+end_comment

* Introduction

A computer lab is usually a classroom of 20-30 computers, connected to
a switch that makes a LAN. These computers are usually managed with
LTSP, which reduces the hardware costs and the time and efforts needed
for installing and maintaining all of them.

What if there is no computer lab but all the students have laptops?
Can we build a similar infrastructure, based on WiFi? Yes we can, and
in this article we will see how.

What if the students are not located on the same classroom but are
distributed all over the world? Can we offer them some centralized
services and build a virtual classroom? There may be many ways of
doing it but we will see just one.


* There Is No Computer Lab

In some computer science departments there are no computer labs
anymore. Instead, the students are required to bring and use their own
laptops. Let's see how we can build some kind of infrastructure in
this case.

We will use the laptop of the teacher as a server, so let's assume
that it has at least 4GB RAM. Actually we will install the server on a
VirtualBox machine, which is the most easy and the most flexible way.

*Note:* Installing the server on a virtual machine provides isolation
and encapsulation, so that the configurations of the server do not
mess with the configurations of the rest of the laptop.  This way the
laptop can be used for other purposes as well.

** Build a Wi-Fi LAN

We need a Wi-Fi LAN, so that the laptops can communicate with the
server.  Often there is some Wi-Fi access point nearby. By connecting
to it, laptops will be able to communicate with each-other as well. In
this case we have nothing to do.

If there is no Wi-Fi access point that can be used, we can create one
with smartphone (Android or iPhone) and connect all the laptops to it.

Another way is to start a hotspot on one of the laptops (for example
on the laptop of the teacher). It can be done easily with a script,
like this:
#+begin_example
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/hotspot.sh
chmod +x hotspot.sh
./hotspot.sh start
#+end_example

The script =hotspot.sh= basically just calls the command =nmcli= with
propper arguments:
#+begin_example
nmcli dev wifi hotspot ifname "$ifname" ssid "$ssid" password "$pass"
#+end_example


** Install a VirtualBox LTSP Server

The most easy way to install a LTSP server on a VirtualBox machine is
to use the [[https://gitlab.com/Virtual-LTSP/VirtualBox][Virtual LTSP]] scripts:
 - Install virtualbox and vagrant: =apt install virtualbox virtualbox-qt vagrant=
 - Get the scripts:
   #+begin_example
   git clone https://gitlab.com/Virtual-LTSP/VirtualBox ltsp
   cd ltsp/
   #+end_example
 - Edit ~settings.sh~ and make sure to:
    + set *DEVELOPMENT="no"*
    + set *GATEWAY="no"*
    + set *LAN_IF* to the name of the Wi-Fi interface (check them with
      =ip addr=)
    + change *ADMIN_PASS*, *GUEST_PASS*, *GUAC_PASS*
    + optionally change *HOSTNAME* and the *PACKAGES* that need to be
      installed on the clients
    + optionally change *VM_BOX* and *VM_RAM*, if you want to change the
      base system, or to allocate more RAM to the virtual machine
  - Start the installation with: =./server.sh build= It takes a lot of
    time to download images and to install packages, so be patient.

Use =./server.sh halt= to stop the server and =./server.sh up= to start it
again. Or go to ~ltsp-server/~ and use =vagrant halt= and =vagrant up=. You
can use =vagrant ssh= as well, to login to the server, if needed.


** Start a VirtualBox LTSP Client

Students can create on the laptop a VirtualBox machine that boots from
the network as a LTSP client.

Here are the steps for building it manually:
1. Create a new VirtualBox machine, with 1GB RAM and no virtual hard
   disk.
1. On the *Settings* of this machine, go to *System* settings, select
   *Network* on the *Boot Order:* and uncheck the other options.
1. On the *Network* settings select a *Bridged Adapter*, and on the list
   select the Wi-Fi network interface (something like /wlp2s0b1/). Use
   the command =ip addr= to figure out the names of the network
   interfaces.

This VirtualBox machine will boot from the LTSP server through the
Wi-Fi network.

You can also use this script to create and start automatically a
VirtualBox LTSP client:
https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/scripts/ltsp-client.sh
#+begin_example
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/scripts/ltsp-client.sh
chmod +x ltsp-client.sh
./ltsp-client.sh --help
ip link
./ltsp-client.sh start -m 1024 -i wlp2s0b1
#+end_example


** LTSP Scenarios

