_posts/2019-01-13-adhock-computer-lab.html
---
layout:     post
title:      Ad-Hock Computer Lab
date:       2019-01-13

summary: A computer lab is usually a classroom of 20-30 computers, connected
  to a switch that makes a LAN. These computers are usually managed with LTSP,
  which reduces the hardware costs and the time and efforts needed for
  installing and maintaining all of them. What if there is no computer lab
  but all the students have laptops? Can we build a similar infrastructure,
  based on WiFi? Yes we can, and in this article we will see how. What if
  the students are not located on the same classroom but are distributed
  all over the world? Can we offer them some centralized services and build
  a virtual classroom? There may be many ways of doing it but we will
  see just one.

tags:       LTSP VirtualBox vagrantup Guacamole docker
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ad-Hock Computer Lab</title>
<!-- 2019-01-13 Sun 08:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">Ad-Hock Computer Lab</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. There Is No Computer Lab</a>
<ul>
<li><a href="#sec-2-1">2.1. Build a Wi-Fi LAN</a></li>
<li><a href="#sec-2-2">2.2. Install a VirtualBox LTSP Server</a></li>
<li><a href="#sec-2-3">2.3. Start a VirtualBox LTSP Client</a></li>
<li><a href="#sec-2-4">2.4. LTSP Scenarios</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Screen Sharing With Epoptes</a></li>
<li><a href="#sec-2-4-2">2.4.2. Manage Student Accounts</a></li>
<li><a href="#sec-2-4-3">2.4.3. Install New Applications On The Clients</a></li>
<li><a href="#sec-2-4-4">2.4.4. Customize The Guest Accounts</a></li>
<li><a href="#sec-2-4-5">2.4.5. Change The RAM Of The Server</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Install Guacamole</a></li>
<li><a href="#sec-2-6">2.6. Guacamole Scenarios</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. Access Account From A Browser</a></li>
<li><a href="#sec-2-6-2">2.6.2. Teacher Sharing His Screen With The Students</a></li>
<li><a href="#sec-2-6-3">2.6.3. Students Collaborating With The Teacher And With Each-Other</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. There Is No Classroom</a>
<ul>
<li><a href="#sec-3-1">3.1. Install A Docker Desktop Server On The Cloud</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Install Docker</a></li>
<li><a href="#sec-3-1-2">3.1.2. Install Docker-Scripts</a></li>
<li><a href="#sec-3-1-3">3.1.3. Install Web Server Proxy</a></li>
<li><a href="#sec-3-1-4">3.1.4. Build The Desktop Container</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Docker Server Scenarios</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Install Additional Packages</a></li>
<li><a href="#sec-3-2-2">3.2.2. Manage Student Accounts</a></li>
<li><a href="#sec-3-2-3">3.2.3. Rebuild The Server</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Guacamole Scenarios</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Access Account From A Browser</a></li>
<li><a href="#sec-3-3-2">3.3.2. Teacher Sharing His Screen With The Students</a></li>
<li><a href="#sec-3-3-3">3.3.3. Students Collaborating With The Teacher And With Each-Other</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Making Videoconferences</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
A computer lab is usually a classroom of 20-30 computers, connected to
a switch that makes a LAN. These computers are usually managed with
LTSP, which reduces the hardware costs and the time and efforts needed
for installing and maintaining all of them.
</p>

<p>
What if there is no computer lab but all the students have laptops?
Can we build a similar infrastructure, based on WiFi? Yes we can, and
in this article we will see how.
</p>

<p>
What if the students are not located on the same classroom but are
distributed all over the world? Can we offer them some centralized
services and build a virtual classroom? There may be many ways of
doing it but we will see just one.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> There Is No Computer Lab</h2>
<div class="outline-text-2" id="text-2">
<p>
In some computer science departments there are no computer labs
anymore. Instead, the students are required to bring and use their own
laptops. Let's see how we can build some kind of infrastructure in
this case.
</p>

<p>
We will use the laptop of the teacher as a server, so let's assume
that it has at least 4GB RAM. Actually we will install the server on a
VirtualBox machine, which is the most easy and the most flexible way.
</p>

<p>
<b>Note:</b> Installing the server on a virtual machine provides isolation
and encapsulation, so that the configurations of the server do not
mess with the configurations of the rest of the laptop.  This way the
laptop can be used for other purposes as well.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Build a Wi-Fi LAN</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We need a Wi-Fi LAN, so that the laptops can communicate with the
server.  Often there is some Wi-Fi access point nearby. By connecting
to it, laptops will be able to communicate with each-other as well. In
this case we have nothing to do.
</p>

<p>
If there is no Wi-Fi access point that can be used, we can create one
with smartphone (Android or iPhone) and connect all the laptops to it.
</p>

<p>
Another way is to start a hotspot on one of the laptops (for example
on the laptop of the teacher). It can be done easily with a script,
like this:
</p>
<pre class="example">
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/hotspot.sh
chmod +x hotspot.sh
./hotspot.sh start
</pre>

<p>
The script <code>hotspot.sh</code> basically just calls the command <code>nmcli</code> with
propper arguments:
</p>
<pre class="example">
nmcli dev wifi hotspot ifname "$ifname" ssid "$ssid" password "$pass"
</pre>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Install a VirtualBox LTSP Server</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The most easy way to install a LTSP server on a VirtualBox machine is
to use the <a href="https://gitlab.com/Virtual-LTSP/VirtualBox">Virtual LTSP</a> scripts:
</p>
<ul class="org-ul">
<li>Install virtualbox and vagrant: <code>apt install virtualbox virtualbox-qt vagrant</code>
</li>
<li>Get the scripts:
<pre class="example">
git clone https://gitlab.com/Virtual-LTSP/VirtualBox ltsp
cd ltsp/
</pre>
</li>
<li>Edit <code>settings.sh</code> and make sure to:
<ul class="org-ul">
<li>set *DEVELOPMENT="no"*
</li>
<li>set *GATEWAY="no"*
</li>
<li>set <b>LAN_IF</b> to the name of the Wi-Fi interface (check them with
<code>ip addr</code>)
</li>
<li>change <b>ADMIN_PASS</b>, <b>GUEST_PASS</b>, <b>GUAC_PASS</b>
</li>
<li>optionally change <b>HOSTNAME</b> and the <b>PACKAGES</b> that need to be
installed on the clients
</li>
<li>optionally change <b>VM_BOX</b> and <b>VM_RAM</b>, if you want to change the
base system, or to allocate more RAM to the virtual machine
</li>
<li>Start the installation with: <code>./server.sh build</code> It takes a lot of
time to download images and to install packages, so be patient.
</li>
</ul>
</li>
</ul>

<p>
Use <code>./server.sh halt</code> to stop the server and <code>./server.sh up</code> to start it
again. Or go to <code>ltsp-server/</code> and use <code>vagrant halt</code> and <code>vagrant up</code>. You
can use <code>vagrant ssh</code> as well, to login to the server, if needed.
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Start a VirtualBox LTSP Client</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Students can create on the laptop a VirtualBox machine that boots from
the network as a LTSP client.
</p>

<p>
Here are the steps for building it manually:
</p>
<ol class="org-ol">
<li>Create a new VirtualBox machine, with 1GB RAM and no virtual hard
disk.
</li>
<li>On the <b>Settings</b> of this machine, go to <b>System</b> settings, select
<b>Network</b> on the <b>Boot Order:</b> and uncheck the other options.
</li>
<li>On the <b>Network</b> settings select a <b>Bridged Adapter</b>, and on the list
select the Wi-Fi network interface (something like <i>wlp2s0b1</i>). Use
the command <code>ip addr</code> to figure out the names of the network
interfaces.
</li>
</ol>

<p>
This VirtualBox machine will boot from the LTSP server through the
Wi-Fi network.
</p>

<p>
You can also use this script to create and start automatically a
VirtualBox LTSP client:
<a href="https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/client.sh">https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/client.sh</a>
</p>
<pre class="example">
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/client.sh
chmod +x client.sh
./client.sh --help
ip link
./client.sh start -m 1024 -i wlp2s0b1
</pre>
</div>
</div>
