_org/_posts/2019-01-13-adhock-computer-lab.org
*** Screen Sharing With Epoptes

The teacher can use Epoptes to share (broadcast) his screen with the
students, or to watch what they are doing and help them (monitor and
assist): http://www.epoptes.org/screenshots

The username of the teacher should be added to the group *epoptes* in
order to be able to use it: =adduser username epoptes= . Or you can create
another admin user, which automatically is added to this group:
#+begin_example
cd ltsp-server/
vagrant ssh
sudo su
cd /host/scripts/
./create-admin-account.sh username password
#+end_example

*** Manage Student Accounts

The script ~scripts/users.sh~ can be used to *create*, *export*, *import*,
*backup* and *restore* user accounts. Try it like this:
#+begin_example
cd ltsp-server/
vagrant ssh
sudo su
cd /host/
script/users.sh --help
script/users.sh create user-list.txt
script/users.sh backup
script/users.sh restore backup/users-20190113.tgz
#+end_example

This is useful when you need to create lots of accounts.  Also, when
you need to rebuild the virtual LTSP server, you can backup user
accounts before doing it and restore them afterwards.

*** Install New Applications On The Clients

Usually you list the packages that should be installed on the client
on the variable =PACKAGES= on ~settings.sh~:
#+begin_example
# List of extra packages that need to be installed on the client.
# For example: ubuntu-edu-preschool, ubuntu-edu-primary, etc.
PACKAGES="
  vim
  geany
  xfce4-terminal
"
#+end_example

However, often you need to install more packages (or to remove some)
after the server has been built. In this case you have to make these
customizations on the chroot directory and then rebuild the client
image:
#+begin_example
cd ltsp-server/
vagrant ssh

sudo su
rm /opt/ltsp/i386/etc/resolv.conf
ltsp-chroot -mr

apt update
apt upgrade
apt install emacs
exit    # from chroot

ltsp-update-image
systemctl restart nbd-server
#+end_example

*** Customize The Guest Accounts

On ~settings.sh~ there are these variables:
#+begin_example
# If GUEST_ACCOUNTS is "yes" then guest accounts are created and
# a "Login as Guest" button is provided on the clients. Everything
# on a guest account will be reset on login.
#
# If GUEST_AUTOLOGIN is "yes", then the client will automatically
# login to a guest account as soon as it boots.
#
# The account GUEST_USER is used as a template (skeleton) for the
# guest accounts. You can login to this account in order to customize
# and tweak all the guest accounts.
GUEST_ACCOUNTS="yes"
GUEST_AUTOLOGIN="no"
GUEST_USER="guest"
GUEST_PASS="pass1"
#+end_example

If you login to and customize the account of GUEST_USER (for example
change the background), this will be applied to all the guest logins.

*** Change The RAM Of The Server

You can easily increase or decrease the RAM of the VirtualBox LSP server
like this:
- Stop the server with: =./server.sh halt= (or =cd ltsp-server/ ; vagrant halt=)
- Edit ~settings.sh~ and change =VB_RAM=
- Start the server with: =./server.sh up= (or =cd ltsp-server/ ; vagrant up=)

The same also works for changing =LAN_IF= (the network interface that is
connected to the LAN). However for changing the other settings you
need to rebuild the server (with =./server.sh build=). If you want to
preserve the user accounts, make sure to backup them first, and
restore them after the rebuild.


** Install Guacamole

Guacamole allows desktop access to a server from a web browser.
When you install a virtual LTSP server, Guacamole is installed as well.
This is the section about Guacamole on ~settings.sh~:
#+begin_example
# Access the server from the web with Guacamole
# https://guacamole.apache.org/doc/gug/using-guacamole.html
# It can be accessed on: https://127.0.0.1/guac/
# Comment out to disable installing Guacamole.
GUAC_ADMIN="admin"
GUAC_PASS="pass1"
#VNC_PORT="5901"
#VNC_WIDTH="1024"
#VNC_HEIGHT="768"
#VNC_DEPTH="24"
#+end_example

However you can install it on any *bionic* server, without having to
install LTSP and other related things. It can be done like this:
#+begin_example
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/scripts/install-guacamole.sh
chmod +x install-guacamole.sh
./install-guacamole.sh
#+end_example


** Guacamole Scenarios

*** Access Account From A Browser

Any user that has an account on the server can access the desktop of
the server from a web browser. He can do it like this:
- Open =https://12.34.56.78/guac/= on the browser. Here =12.34.56.78=
  is the IP of the server, most probably something like
  =192.168.0.xy=, or =10.42.0.1= if you started a hotspot from the
  laptop.
- Click on the button "Login" without a username and password.
- Click on the RDP connection.
- Give the username and password of the account.

*Note:* I have noticed that sometimes the firewall has a glitch,
especially when a hotspot is started, which prevents the server from
being accessed from the clients. When this happens, I try =ufw
disable= and then =ufw enable=, and the problem goes away somehow.


*** Teacher Sharing His Screen With The Students

This is useful when the teacher wants to demonstrate to the students
how to do something, for example how to write a program. Usually a
projector is used to show the desktop of the teacher, but this is a
nice alternative too, especially when there is no projector available.

To be able to share the screen of his account, the teacher should enter
in Guacamole with the username =student= or =admin= (and the
corresponding password). This is different from the case above, where
he could login in Guacamole even without a username and password.

Then he should go to his account by clicking on the RDP connection and
giving the username and password of his account. Afterwards he should
follow these steps:
- Press Ctrl+Alt+Shift to open the Guacamole panel on the left side.
- Click on the "Share" menu of the top and then on "Watch".
- Right-click on the link that is displayed and copy it.
- Open =https://12.34.56.78/chat/= (or =https://10.42.0.1/chat/=)
  and post the link there to share it with the students.

Once the students open in browser the link of the shared Guacamole
session they will be able to see the desktop of the teacher and what
he is doing.

