_posts/2019-01-13-adhock-computer-lab.html


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> LTSP Scenarios</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Screen Sharing With Epoptes</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
The teacher can use Epoptes to share (broadcast) his screen with the
students, or to watch what they are doing and help them (monitor and
assist): <a href="http://www.epoptes.org/screenshots">http://www.epoptes.org/screenshots</a>
</p>

<p>
The username of the teacher should be added to the group <b>epoptes</b> in
order to be able to use it: <code>adduser username epoptes</code> . Or you can create
another admin user, which automatically is added to this group:
</p>
<pre class="example">
cd ltsp-server/
vagrant ssh
sudo su
cd /host/scripts/
./create-admin-account.sh username password
</pre>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Manage Student Accounts</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
The script <code>scripts/users.sh</code> can be used to <b>create</b>, <b>export</b>, <b>import</b>,
<b>backup</b> and <b>restore</b> user accounts. Try it like this:
</p>
<pre class="example">
cd ltsp-server/
vagrant ssh
sudo su
cd /host/
script/users.sh --help
script/users.sh create user-list.txt
script/users.sh backup
script/users.sh restore backup/users-20190113.tgz
</pre>

<p>
This is useful when you need to create lots of accounts.  Also, when
you need to rebuild the virtual LTSP server, you can backup user
accounts before doing it and restore them afterwards.
</p>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> Install New Applications On The Clients</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Usually you list the packages that should be installed on the client
on the variable <code>PACKAGES</code> on <code>settings.sh</code>:
</p>
<pre class="example">
# List of extra packages that need to be installed on the client.
# For example: ubuntu-edu-preschool, ubuntu-edu-primary, etc.
PACKAGES="
  vim
  geany
  xfce4-terminal
"
</pre>

<p>
However, often you need to install more packages (or to remove some)
after the server has been built. In this case you have to make these
customizations on the chroot directory and then rebuild the client
image:
</p>
<pre class="example">
cd ltsp-server/
vagrant ssh

sudo su
rm /opt/ltsp/i386/etc/resolv.conf
ltsp-chroot -mr

apt update
apt upgrade
apt install emacs
exit    # from chroot

ltsp-update-image
systemctl restart nbd-server
</pre>
</div>
</div>

<div id="outline-container-sec-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="section-number-4">2.4.4</span> Customize The Guest Accounts</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
On <code>settings.sh</code> there are these variables:
</p>
<pre class="example">
# If GUEST_ACCOUNTS is "yes" then guest accounts are created and
# a "Login as Guest" button is provided on the clients. Everything
# on a guest account will be reset on login.
#
# If GUEST_AUTOLOGIN is "yes", then the client will automatically
# login to a guest account as soon as it boots.
#
# The account GUEST_USER is used as a template (skeleton) for the
# guest accounts. You can login to this account in order to customize
# and tweak all the guest accounts.
GUEST_ACCOUNTS="yes"
GUEST_AUTOLOGIN="no"
GUEST_USER="guest"
GUEST_PASS="pass1"
</pre>

<p>
If you login to and customize the account of GUEST_USER (for example
change the background), this will be applied to all the guest logins.
</p>
</div>
</div>

<div id="outline-container-sec-2-4-5" class="outline-4">
<h4 id="sec-2-4-5"><span class="section-number-4">2.4.5</span> Change The RAM Of The Server</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
You can easily increase or decrease the RAM of the VirtualBox LSP server
like this:
</p>
<ul class="org-ul">
<li>Stop the server with: <code>./server.sh halt</code> (or <code>cd ltsp-server/ ; vagrant halt</code>)
</li>
<li>Edit <code>settings.sh</code> and change <code>VB_RAM</code>
</li>
<li>Start the server with: <code>./server.sh up</code> (or <code>cd ltsp-server/ ; vagrant up</code>)
</li>
</ul>

<p>
The same also works for changing <code>LAN_IF</code> (the network interface that is
connected to the LAN). However for changing the other settings you
need to rebuild the server (with <code>./server.sh build</code>). If you want to
preserve the user accounts, make sure to backup them first, and
restore them after the rebuild.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Install Guacamole</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Guacamole allows desktop access to a server from a web browser.
When you install a virtual LTSP server, Guacamole is installed as well.
This is the section about Guacamole on <code>settings.sh</code>:
</p>
<pre class="example">
# Access the server from the web with Guacamole
# https://guacamole.apache.org/doc/gug/using-guacamole.html
# It can be accessed on: https://127.0.0.1/guac/
# Comment out to disable installing Guacamole.
GUAC_ADMIN="admin"
GUAC_PASS="pass1"
#VNC_PORT="5901"
#VNC_WIDTH="1024"
#VNC_HEIGHT="768"
#VNC_DEPTH="24"
</pre>

<p>
However you can install it on any <b>bionic</b> server, without having to
install LTSP and other related things. It can be done like this:
</p>
<pre class="example">
wget https://gitlab.com/Virtual-LTSP/VirtualBox/raw/bionic/scripts/install-guacamole.sh
chmod +x install-guacamole.sh
./install-guacamole.sh
</pre>
</div>
</div>


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Guacamole Scenarios</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Access Account From A Browser</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
Any user that has an account on the server can access the desktop of
the server from a web browser. He can do it like this:
</p>
<ul class="org-ul">
<li>Open <code>https://12.34.56.78/guac/</code> on the browser. Here <code>12.34.56.78</code>
is the IP of the server, most probably something like
<code>192.168.0.xy</code>, or <code>10.42.0.1</code> if you started a hotspot from the
laptop.
</li>
<li>Click on the button "Login" without a username and password.
</li>
<li>Click on the RDP connection.
</li>
<li>Give the username and password of the account.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> Teacher Sharing His Screen With The Students</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
This is useful when the teacher wants to demonstrate to the students
how to do something, for example how to write a program. Usually a
projector is used to show the desktop of the teacher, but this is a
nice alternative too, especially when there is no projector available.
</p>

<p>
To be able to share the screen of his account, the teacher should enter
in Guacamole with the username <code>student</code> or <code>admin</code> (and the
corresponding password). This is different from the case above, where
he could login in Guacamole even without a username and password.
</p>

<p>
Then he should go to his account by clicking on the RDP connection and
giving the username and password of his account. Afterwards he should
follow these steps:
</p>
<ul class="org-ul">
<li>Press Ctrl+Alt+Shift to open the Guacamole panel on the left side.
</li>
<li>Click on the "Share" menu of the top and then on "Watch".
</li>
<li>Right-click on the link that is displayed and copy it.
</li>
<li>Open <code>https://12.34.56.78/chat/</code> (or <code>https://10.42.0.1/chat/</code>)
and post the link there to share it with the students.
</li>
</ul>

<p>
Once the students open in browser the link of the shared Guacamole
session they will be able to see the desktop of the teacher and what
he is doing.
</p>
</div>
</div>
