_org/_posts/2019-01-13-adhock-computer-lab.org
*** Students Collaborating With The Teacher And With Each-Other

The students can share their desktop too with the teacher and with
other students. This is useful when a student is stuck and needs some
help (for example he cannot find a bug in the program) or when the
students are working in pairs or in groups.

To be able to share his desktop a student should login in Guacamole
with the username student. Then he should follow the same steps as
above, except that he should select "Collaborate" from the menu of
"Share", instead of "Watch". The difference is that with "Collaborate"
both parties (or all of them) can use the keyboard and mouse to work
together, instead of just watching what the other person does.

Again they can use the chat (=https://10.42.0.1/chat/=) to share the
link of the guacamole session with the others.



* There Is No Classroom

Teaching online is becoming common nowadays. In this case the students
may be distributed all over the world. But it can also be combined
with traditional teaching, where the students sometimes meet in a
classroom and sometimes meet online.

In this case the students are assumed to have a computer at home and
good internet connection. The server will be a VPS on the cloud. It
can also be located at the school/university, provided that there is
good internet connection, however it is becoming increasingly more
easy, cheaper and better to have it on the cloud.


** Install A Docker Desktop Server On The Cloud

The server will be installed on a Docker container, with the help of
docker-scripts.

*Note:* I have tried these installation steps on a server on [[https://www.hetzner.com/cloud][Hetzner
Cloud]] installed with Ubuntu-18.04, but it should be almost the same
on other Linux servers.

*** Install Docker

Instructions for installing Docker on Ubuntu are here:
https://docs.docker.com/install/linux/docker-ce/ubuntu/

- Add the docker repository on the list of package repositories:
  #+begin_example
  apt update
  apt install \
      apt-transport-https \
      ca-certificates \
      curl \
      software-properties-common

  curl -fsSL https://download.docker.com/linux/ubuntu/gpg | apt-key add -

  add-apt-repository \
     "deb [arch=amd64] https://download.docker.com/linux/ubuntu \
     $(lsb_release -cs) \
     stable"
  #+end_example

- Install the package =docker-ce=:
  #+begin_example
  apt update
  apt install docker-ce
  #+end_example

- Verify that Docker CE is installed correctly by running the hello-world image:
  #+begin_example
  docker container run hello-world
  #+end_example

*** Install Docker-Scripts

[[https://github.com/docker-scripts/ds][DockerScripts]] is a shell script framework for Docker. It facilitates
creating and maintaining docker containers.

Use these commands to install it:
#+begin_example
apt install m4
git clone https://github.com/docker-scripts/ds /opt/docker-scripts/ds
cd /opt/docker-scripts/ds/
make install
ds
ds -h
#+end_example

*** Install Web Server Proxy

We need [[https://github.com/docker-scripts/wsproxy][wsproxy]] in order to get and maintain the free letsencrypt SSL
certificates. It can be installed like this:
- Get its code: =ds pull wsproxy=
- Init a container directory for it: =ds init wsproxy @wsproxy=
- Customize the settings: =cd /var/ds/wsproxy/; vim settings.sh=
- Build image, create the container and configure it: =ds make=

*** Build The Desktop Container

- Get its code: =ds pull desktop=
- Init a container directory for it: =ds init desktop @desktop.example.org=
- Customize the settings: =cd /var/ds/desktop.example.org/; vim settings.sh=
- Build image, create the container and configure it: =ds make=


** Docker Server Scenarios

*** Install Additional Packages

You can go inside the docker container and install other packages with
=apt=, like this:
#+begin_example
cd /var/ds/desk.example.org/
ds shell
apt install ubuntu-edu-preschool ubuntu-edu-primary firefox
exit
#+end_example

However in case you rebuild the server you will have to install them
again manually.  To install them automatically on each rebuild of the
server, create a file like ~/var/ds/desk.example.org/packages~ with a
content like this:
#+begin_example
RUN DEBIAN_FRONTEND=noninteractive \
    apt install --yes \
        ubuntu-edu-preschool \
        ubuntu-edu-primary \
        firefox
#+end_example

*** Manage Student Accounts

The script ~users.sh~ can be used to *create*, *export*, *import*,
*backup* and *restore* user accounts. Try it like this:
#+begin_example
cd /var/ds/desk.example.org/
ds shell

/app-scripts/users.sh --help
/app-scripts/users.sh create user-list.txt
/app-scripts/users.sh backup
/app-scripts/users.sh restore backup/users-20190113.tgz
#+end_example

*** Rebuild The Server

Before rebuilding the server you should make first a backup of the
user accounts and homes, and after rebuilding it you should restore
them:
#+begin_example
cd /var/ds/desk.example.org/

ds shell
/app-scripts/users.sh backup
exit

ds make

ds shell
/app-scripts/users.sh restore backup/users-20190113.tgz
exit
#+end_example

** Guacamole Scenarios

Guacamole is installed by default on the server and allows desktop
access to the server from a web browser. Every application and
everything runs on the server and the client does not consume any
resources, except for a browser tab. This is very convenient because:
- Does not require installation of any additional tools or
  applications, except a web browser.
- It is cross-platform and universal. The desktop can be accessed from
  any system, on any architecture. This includes ChromeOS, RaspberryPi,
  tablets, smartphones, or any other not powerful computers.

Things that we can do with Guacamole on a cloud server are almost the
same that we can do on a local server.

*** Access Account From A Browser

Any user that has an account on the server can access the desktop of
the server from a web browser. He can do it like this:
- Open =https://desk.example.org:444/guac/= on the browser. Here the
  port =444= is the one that is forwarded to port =443= on
  ~settings.sh~
- Click on the button "Login" without a username and password.
- Click on the RDP connection.
- Give the username and password of the account.

