_posts/2019-01-13-adhock-computer-lab.html

<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="section-number-4">2.6.3</span> Students Collaborating With The Teacher And With Each-Other</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
The students can share their desktop too with the teacher and with
other students. This is useful when a student is stuck and needs some
help (for example he cannot find a bug in the program) or when the
students are working in pairs or in groups.
</p>

<p>
To be able to share his desktop a student should login in Guacamole
with the username student. Then he should follow the same steps as
above, except that he should select "Collaborate" from the menu of
"Share", instead of "Watch". The difference is that with "Collaborate"
both parties (or all of them) can use the keyboard and mouse to work
together, instead of just watching what the other person does.
</p>

<p>
Again they can use the chat (<code>https://10.42.0.1/chat/</code>) to share the
link of the guacamole session with the others.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> There Is No Classroom</h2>
<div class="outline-text-2" id="text-3">
<p>
Teaching online is becoming common nowadays. In this case the students
may be distributed all over the world. But it can also be combined
with traditional teaching, where the students sometimes meet in a
classroom and sometimes meet online.
</p>

<p>
In this case the students are assumed to have a computer at home and
good internet connection. The server will be a VPS on the cloud. It
can also be located at the school/university, provided that there is
good internet connection, however it is becoming increasingly more
easy, cheaper and better to have it on the cloud.
</p>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Install A Docker Desktop Server On The Cloud</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The server will be installed on a Docker container, with the help of
docker-scripts.
</p>

<p>
<b>Note:</b> I have tried these installation steps on a server on <a href="https://www.hetzner.com/cloud">Hetzner
Cloud</a> installed with Ubuntu-18.04, but it should be almost the same
on other Linux servers.
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Install Docker</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Instructions for installing Docker on Ubuntu are here:
<a href="https://docs.docker.com/install/linux/docker-ce/ubuntu/">https://docs.docker.com/install/linux/docker-ce/ubuntu/</a>
</p>

<ul class="org-ul">
<li>Add the docker repository on the list of package repositories:
<pre class="example">
apt update
apt install \
    apt-transport-https \
    ca-certificates \
    curl \
    software-properties-common

curl -fsSL https://download.docker.com/linux/ubuntu/gpg | apt-key add -

add-apt-repository \
   "deb [arch=amd64] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
</pre>
</li>

<li>Install the package <code>docker-ce</code>:
<pre class="example">
apt update
apt install docker-ce
</pre>
</li>

<li>Verify that Docker CE is installed correctly by running the hello-world image:
<pre class="example">
docker container run hello-world
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Install Docker-Scripts</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<a href="https://github.com/docker-scripts/ds">DockerScripts</a> is a shell script framework for Docker. It facilitates
creating and maintaining docker containers.
</p>

<p>
Use these commands to install it:
</p>
<pre class="example">
apt install m4
git clone https://github.com/docker-scripts/ds /opt/docker-scripts/ds
cd /opt/docker-scripts/ds/
make install
ds
ds -h
</pre>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Install Web Server Proxy</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
We need <a href="https://github.com/docker-scripts/wsproxy">wsproxy</a> in order to get and maintain the free letsencrypt SSL
certificates. It can be installed like this:
</p>
<ul class="org-ul">
<li>Get its code: <code>ds pull wsproxy</code>
</li>
<li>Init a container directory for it: <code>ds init wsproxy @wsproxy</code>
</li>
<li>Customize the settings: <code>cd /var/ds/wsproxy/; vim settings.sh</code>
</li>
<li>Build image, create the container and configure it: <code>ds make</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Build The Desktop Container</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>Get its code: <code>ds pull desktop</code>
</li>
<li>Init a container directory for it: <code>ds init desktop @desktop.example.org</code>
</li>
<li>Customize the settings: <code>cd /var/ds/desktop.example.org/; vim settings.sh</code>
</li>
<li>Build image, create the container and configure it: <code>ds make</code>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Docker Server Scenarios</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Install Additional Packages</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
You can go inside the docker container and install other packages with
<code>apt</code>, like this:
</p>
<pre class="example">
cd /var/ds/desk.example.org/
ds shell
apt install ubuntu-edu-preschool ubuntu-edu-primary firefox
exit
</pre>

<p>
However in case you rebuild the server you will have to install them
again manually.  To install them automatically on each rebuild of the
server, create a file like <code>/var/ds/desk.example.org/packages</code> with a
content like this:
</p>
<pre class="example">
RUN DEBIAN_FRONTEND=noninteractive \
    apt install --yes \
        ubuntu-edu-preschool \
        ubuntu-edu-primary \
        firefox
</pre>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Manage Student Accounts</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The script <code>users.sh</code> can be used to <b>create</b>, <b>export</b>, <b>import</b>,
<b>backup</b> and <b>restore</b> user accounts. Try it like this:
</p>
<pre class="example">
cd /var/ds/desk.example.org/
ds shell

/app-scripts/users.sh --help
/app-scripts/users.sh create user-list.txt
/app-scripts/users.sh backup
/app-scripts/users.sh restore backup/users-20190113.tgz
</pre>
</div>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Rebuild The Server</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Before rebuilding the server you should make first a backup of the
user accounts and homes, and after rebuilding it you should restore
them:
</p>
<pre class="example">
cd /var/ds/desk.example.org/

ds shell
/app-scripts/users.sh backup
exit

ds make

ds shell
/app-scripts/users.sh restore backup/users-20190113.tgz
exit
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Guacamole Scenarios</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Guacamole is installed by default on the server and allows desktop
access to the server from a web browser. Every application and
everything runs on the server and the client does not consume any
resources, except for a browser tab. This is very convenient because:
</p>
<ul class="org-ul">
<li>Does not require installation of any additional tools or
applications, except a web browser.
</li>
<li>It is cross-platform and universal. The desktop can be accessed from
any system, on any architecture. This includes ChromeOS, RaspberryPi,
tablets, smartphones, or any other not powerful computers.
</li>
</ul>

<p>
Things that we can do with Guacamole on a cloud server are almost the
same that we can do on a local server.
</p>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Access Account From A Browser</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Any user that has an account on the server can access the desktop of
the server from a web browser. He can do it like this:
</p>
<ul class="org-ul">
<li>Open <code>https://desk.example.org:444/guac/</code> on the browser. Here the
port <code>444</code> is the one that is forwarded to port <code>443</code> on
<code>settings.sh</code>
</li>
<li>Click on the button "Login" without a username and password.
</li>
<li>Click on the RDP connection.
</li>
<li>Give the username and password of the account.
</li>
</ul>
</div>
</div>
