_org/_posts/2019-01-13-adhock-computer-lab.org
*** Teacher Sharing His Screen With The Students

This is useful when the teacher wants to demonstrate to the students
how to do something, for example how to write a program.

To be able to share the screen of his account, the teacher should enter
in Guacamole with the username =student= or =admin= (and the
corresponding password).

Then he should go to his account by clicking on the RDP connection and
giving the username and password of his account. Afterwards he should
follow these steps:
- Press Ctrl+Alt+Shift to open the Guacamole panel on the left side.
- Click on the "Share" menu of the top and then on "Watch".
- Right-click on the link that is displayed and copy it.
- Send the link to the students by email, instant message (chat), etc.

Once the students open in browser the link of the shared Guacamole
session, they will be able to see the desktop of the teacher and what
he is doing.

*** Students Collaborating With The Teacher And With Each-Other

The students can share their desktop too with the teacher and with
other students. This is useful when a student is stuck and needs some
help (for example he cannot find a bug in the program) or when the
students are working in pairs or in groups.

To be able to share his desktop a student should login in Guacamole
with the username student. Then he should follow the same steps as
above, except that he should select "Collaborate" from the menu of
"Share", instead of "Watch". The difference is that with "Collaborate"
both parties (or all of them) can use the keyboard and mouse to work
together, instead of just watching what the other person does.

Then they can use email or chat to share the link of the guacamole
session with the others.


** Making Videoconferences

Sharing the desktop with other people is most useful when you can also
talk and discuss with them. This can be achieved even by phone calls,
but videoconference applications are more useful, and there are plenty
of them. I would suggest https://meet.jit.si/ for these reasons:
- It is completely browser based and does not need any special tools
  or applications to be installed.
- Working straight from the browser means also that it is also
  cross-platform and can be used on any system that has a browser
  (Linux, Windows, MacOS, ChromeOS, etc.)
- It is completely free to use and does not have any limitations on
  the number of participants in a meeting.
- It is very easy to use and does not even ask for users to register
  or have an account.
- The software that it uses is free software and anybody can install
  it on his own server and build his own videoconference server.

Some other useful features that videoconference applications usually
have are:
- Instant messaging (chat), which can be useful for sharing url-s.
- File sending and sharing.
- Desktop sharing. With jitsi you can even share the view of a
  specific application or a specific tab of the browser.

