_posts/2019-01-13-adhock-computer-lab.html

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Teacher Sharing His Screen With The Students</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
This is useful when the teacher wants to demonstrate to the students
how to do something, for example how to write a program.
</p>

<p>
To be able to share the screen of his account, the teacher should enter
in Guacamole with the username <code>student</code> or <code>admin</code> (and the
corresponding password).
</p>

<p>
Then he should go to his account by clicking on the RDP connection and
giving the username and password of his account. Afterwards he should
follow these steps:
</p>
<ul class="org-ul">
<li>Press Ctrl+Alt+Shift to open the Guacamole panel on the left side.
</li>
<li>Click on the "Share" menu of the top and then on "Watch".
</li>
<li>Right-click on the link that is displayed and copy it.
</li>
<li>Send the link to the students by email, instant message (chat), etc.
</li>
</ul>

<p>
Once the students open in browser the link of the shared Guacamole
session, they will be able to see the desktop of the teacher and what
he is doing.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Students Collaborating With The Teacher And With Each-Other</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
The students can share their desktop too with the teacher and with
other students. This is useful when a student is stuck and needs some
help (for example he cannot find a bug in the program) or when the
students are working in pairs or in groups.
</p>

<p>
To be able to share his desktop a student should login in Guacamole
with the username student. Then he should follow the same steps as
above, except that he should select "Collaborate" from the menu of
"Share", instead of "Watch". The difference is that with "Collaborate"
both parties (or all of them) can use the keyboard and mouse to work
together, instead of just watching what the other person does.
</p>

<p>
Then they can use email or chat to share the link of the guacamole
session with the others.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Making Videoconferences</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Sharing the desktop with other people is most useful when you can also
talk and discuss with them. This can be achieved even by phone calls,
but videoconference applications are more useful, and there are plenty
of them. I would suggest <a href="https://meet.jit.si/">https://meet.jit.si/</a> for these reasons:
</p>
<ul class="org-ul">
<li>It is completely browser based and does not need any special tools
or applications to be installed.
</li>
<li>Working straight from the browser means also that it is also
cross-platform and can be used on any system that has a browser
(Linux, Windows, MacOS, ChromeOS, etc.)
</li>
<li>It is completely free to use and does not have any limitations on
the number of participants in a meeting.
</li>
<li>It is very easy to use and does not even ask for users to register
or have an account.
</li>
<li>The software that it uses is free software and anybody can install
it on his own server and build his own videoconference server.
</li>
</ul>

<p>
Some other useful features that videoconference applications usually
have are:
</p>
<ul class="org-ul">
<li>Instant messaging (chat), which can be useful for sharing url-s.
</li>
<li>File sending and sharing.
</li>
<li>Desktop sharing. With jitsi you can even share the view of a
specific application or a specific tab of the browser.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-13</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2019-01-13 Sun 08:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
